# Домашнее задание к занятию "Структура программы".
Задача "Сумматор";
## Описание.
Напишите программу для подсчета суммы 3х целых чисел. Операция суммирования уже считанных чисел должна быть вынесена в отдельный метод.

### Функционал программы
- Ввод первого числа;
- Ввод второго числа;
- Ввод третьего числа;
- Вывести на экран сумму этих чисел (через вызов отдельного метода суммирования).
### Пример.
 ~~~Программа расчета суммы трех чисел
  Введите первое число:
  10 <enter>
  Введите второе число:
  15 <enter>
  Введите третье число:
  20 <enter>
  Сумма чисел = 45
~~~
### Реализация
1. Я импортировал класс  `Scanner`, а так же создал объект типа  `scanner` (для общения с пользователем)

~~~ 
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
    }
}
~~~
2. Я просил пользователя вводить по одному числу
~~~System.out.println("Введите первое число:");
int value1 = scanner.nextInt();
System.out.println("Введите второе число:");
int value1 = scanner.nextInt();
System.out.println("Введите третье число:");
int value1 = scanner.nextInt();
~~~
3. Я создал метод который посчитал сумму сложения все введенных чисел
~~~
  public static int calculateNumber(int a, int b, int c) {
        int result = a + b + c;
        return result;
    }
~~~
4. Я вызвал метод `calculateNumber`.

5. Программа завершина, в консоль выводится сумма всех чисел.
~~~
System.out.println("сумма всех чисел равно " + sum);
~~~




